{
    "isu": {
        "name": "Iowa State University",
        "position": "Bachelor of Science in Management Information Systems",
        "tags": [
            "Education",
            "Graduated August 2024"
        ],
        "preview": "Education through Iowa State University's Ivy College of Business.",
        "body": "<b>Relevant Coursework:</b><br>Object Oriented Programming, Intro to Data Structures, Software Development Practices, Construction of User Interfaces, Database Management Systems, Advanced Business Programming, Cybersecurity in Business."
    },
    "level1": {
        "name": "Level1 TV LLC",
        "position": "Software Engineer",
        "tags": [
            "Freelance / Contract",
            "Remote",
            "May 2023 - Present"
        ],
        "preview": "Esports broadcasting and web app development.",
        "body": "Level1 TV is a primarily northwestern based esports service organization with staff members around North America. They mainly help in grassroots esports broadcasting and event hosting. Level1 is also starting to provide web apps and services to help the esports scene. My duties in Level1 are as follows:<br><ul><li>Developing web apps & services, such as the <a href='https://shop.level1.tv/'>Level1 Shop</a>, an e-commerce service that works with event organizers to make selling merchandise effortless. Merchandise sales help events flourish even in cases where other means of income fall short.</li><li>Functioning with a team through QA and CICD; always seeking better performance & SEO through quick updates.</li><li>Coding mostly in React, Vue, Typescript, and some PHP</li><li>Producing web based livestream packages for major esports events garnering over two million total viewers</li><li>Reporting results and tracking progress using git and a kanban board, resulting in improved collaboration and quality assurance through code reviews</li></ul>"
    },
    "greenlee": {
        "name": "Greenlee School of Journalism and Communication",
        "position": "Student Tech",
        "tags": [
            "On Campus Job",
            "Jan 2022 - May 2024"
        ],
        "preview": "On campus information technology job for the ISU Greenlee School of Journalism and Communication.",
        "body": "I worked at ISU for the School of Journalism's IT department during school. My main job was to assist wherever needed around the building. Most of the time, that involved checking out camera equipment to students, but other times, I had to provide technical support to the numerous computer labs around the building and support faculty with various tech problems. During my time in this position, I've learned some foundational skills in IT. That includes our ticketing system, general troubleshooting, and working well with people who want to become more familiar with technology. I've also had the opportunity to train and teach other students who work here every semester."
    },
    "ciras": {
        "name": "CIRAS",
        "position": "Strategy Intern",
        "tags": [
            "Internship",
            "May 2023 - August 2023"
        ],
        "preview": "Internship involving research to assist in where the organization should focus services and extensive business tours.",
        "body": "During the summer of 2023, I interned with ISU's Center for Industrial Research and Service, or CIRAS for short. They aim to help small to medium-sized Iowa-based businesses grow by engaging, educating, and embedding. My role in my internship was varied:<br><ul><li>I researched a potential \"management systems\" service that CIRAS could provide customers. My mentor knew there was a demand for something like this, but she needed to learn more about the field. I began my research here, examining what and how numerous consulting firms would serve in this field. I had to combine my knowledge of management information systems and data on how consulting firms would assist in the space. At the end of my internship, I presented the data to leaders at CIRAS.</li><li>I collaborated on a project with a client and other interns to help them identify system requirements for a potential project. The process started with a tour one of our mentors took before the summer. He wrote down rough notes during the tour and needed us to clean them up. Once we did that, we sent the notes to the clients to ensure they looked accurate. After communicating what needs to be adjusted, we took the finalized info. We created process map diagrams to present where the client may have shortcomings in their processes.</li><li>The other interns and I had an opportunity with the same company to drive up and conduct a tour ourselves. We took this tour to solidify our process maps and see the process for ourselves instead of just relying on emails. After the tour, we presented the process maps with the company's employees to do one final check. After the tour, we had accurate diagrams and could move forward to start making recommendations to adjust shortcomings.</li><li>The other interns and I took extensive business tours to learn more about how companies around Iowa operate. We visited Arcosa Wind Towers in Newton, Vermeer in Pella, Bunn in Creston, and Collins Aerospace in Ames and Cedar Rapids. I learned a lot about how businesses operated, especially in industry, which was a weak point in my knowledge.</li></ul>I accepted this internship intending to improve the management side of my management info systems degree. Finishing the internship, I felt more well-balanced with newfound skills in business-to-business communication and an overall understanding of how businesses operate..",
        "img": [
            "group.jpg", "tour1.jpg", "tour2.jpg"
        ]
    },
    "ge": {
        "name": "Gaming and Esports Club at ISU",
        "position": "Officer- Design Chair",
        "tags": [
            "Campus Club Leadership",
            "Jan 2023 - May 2024"
        ],
        "preview": "Campus club leadership role with fostering a community around gaming and esports.",
        "body": "In January 2023, I was elected the design chair for the Gaming and Esports Club. While holding this position, I aimed to strengthen the club's branding and develop software to enhance our livestreams. I've also supported organizing on-campus events with the club and networking with fellow students.<br>During the summer of 2023, I was tasked to create and ship our new jersey designs. I worked alongside a designer at a company called EsportsGear to create and ship our new jerseys. The challenge mainly came with getting the ISU logo on them, which has historically been tough. After getting in touch with some contacts at ISU's trademark office, we were able to represent the ISU logo on our jerseys.",
        "img": [
            "clubfest.webp", "coolphoto.jpg", "jerseys.jpg"
        ]
    },
    "ipl": {
        "name": "Inkling Performance Labs",
        "position": "Software Developer",
        "tags": [
            "Esports Hobby",
            "Summer 2019 - Present"
        ],
        "preview": "Freelance esports work with tournament organization, livestreaming, and web development.",
        "body": "IPL is an esports organization integrated into the competitive Splatoon scene. Splatoon is a team-based online shooter developed by Nintendo. Over the years, I've had many roles in the organization, from stream commentator to staff to head tournament organizer. But now, I have a role as an organization leader and production head.<br>I joined IPL in the summer of 2019, and it's been one of my favorite projects. I love feeling productive and creating awesome things with friends. The org has grown so much since I joined, with over five different events and dozens of staff members for each event. Alongside our primarily online events, we are also trusted with running in-person events at major tournaments and conventions.",
        "img": [
            "group.jpg", "group2.jpg"
        ]
    }
}